app/views/helpers/new.html.erb

SELECT "speaker_profiles".* FROM "speaker_profiles" ORDER BY "speaker_profiles"."id" DESC LIMIT 1
---
						<div class="col-md-7">
							<%=f.collection_select :existing, SpeakerProfile.all, :id, :eng_name%>

SELECT "talks".* FROM "talks" ORDER BY "talks"."id" DESC LIMIT 1
---
				});
				  $('.simple_form.talk_content').submit(function()
					{
	    				try{
	    					var tab_active = $(".tab-pane.active");
					      	var all_dates = tab_active.find(".datetimepicker").map(function() {
	    					return this.value;
							}).get();
					     	 document.getElementById("talk_content_date_array").value = all_dates;

					     	var all_checks = tab_active.find(".boolean.optional").map(function() {
	    					return this.checked;
							}).get();
					     	 document.getElementById("talk_content_check_array").value = all_checks;

					    	var all_checks_process_names = tab_active.find(".process_name").map(function() {
	    					return this.textContent;
							}).get();
					     	 document.getElementById("talk_content_name_array").value = all_checks_process_names;


