app/controllers/helpers_controller.rb

  def index
      @talks = Talk.all
---
SELECT "talks".* FROM "talks"

  def create
      @talk_creator = TalkCreator.new
      @talk_creator.insert(params.permit![:talk_content])
---
INSERT INTO "talks" ("created_at", "title", "updated_at") VALUES (?, ?, ?)  [["created_at", Sun, 16 Feb 2014 19:30:34 UTC +00:00], ["title", "HIHI"], ["updated_at", Sun, 16 Feb 2014 19:30:34 UTC +00:00]]